# $interactionReply

## Использование
```js
$interactionReply[Контент;эмбеды?;компоненты?;файлы?;упоминания?;отображаемость?]
```

### Опции
Контент - обычный контент сообщения
Эмбеды - эмбед контент сообщения, сделанный при помощи {newEmbed:...}
Компоненты - компоненты сообщения, например, кнопки и меню выбора {actionRow:...}
Файлы - файлы, прикрепленные к сообщению, например, {attachment:}, {file:}
Упоминания - какие упоминания разрешено использовать в сообщении, например everyone или просто пропустить
Отображаемость - при взаимодействии сообщение будет отображаться только автору или нет, например yes / no

## Пример использования
```javascript
module.exports = {
name: "button",
type: "interaction",
prototype: "button",
code: `$interactionReply[Привет, <@$authorID>!;{newEmbed:{description:Ты нажал на кнопку}};{actionRow:{button:Нажми ещё раз}};;yes]`
}
```
